InformationRegisters/ФедеральныеВебСервисыЗапросыВСервисИдентификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ФедеральныеВебСервисыЗапросыВСервисИдентификации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдКлиента</Name>
					<Comment>Идентификатор клиента (МИС)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеЗапрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗапроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗапросовВСервисИдентификацииОбогащения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщенияИзСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OIDМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщенияИзМИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗапросовВСервисИдентификацииОбогащения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтатусыЗапросовВСервисИдентификацииОбогащения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПроцессеОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменВыполненСОшибками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоМИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтправленоВСервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ФедеральныеВебСервисыЗапросыВСервисИдентификации/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

/// Добавление записи регистра
//
// Параметры:
//   ИдентификаторСообщенияИзМИС - Строка -
//     Идентификатор сообщения из МИС.
//   УзелОбменаСМИС - ПланОбменаСсылка.ФедеральныеВебСервисыМИСДляПрокси -
//     узел обмена с МИС.
//   Статус - ПеречислениеСсылка.СтатусыЗапросовВСервисИдентификацииОбогащения -
//     Статус запроса в сервис идентификации.
//   СообщениеЗапрос - Строка -
//     Текст сообщения.
//   СообщениеОтвет - Строка -
//     Текст сообщения.
//   ИдентификаторЗапроса - Строка -
//     Идентификатор запроса.
//   ДатаЗапроса - Дата -
//     Дата запроса.
//   ДатаОтвета - Дата -
//     Дата ответа.
//   Результат - Строка -
//     Данные результата.
//   OIDМО - Строка -
//     OID медицинской организации, от которой был получен запрос
//   ДанныеПациента - Структура
//    Структура, содержащая данные пациента.
///
Процедура ЗаписатьСообщениеЗапрос( // 11 параметров
	ИдентификаторСообщенияИзМИС,
	ИдКлиента,
	Статус,
	СообщениеЗапрос,
	СообщениеОтвет,
	ИдентификаторЗапроса,
	ДатаЗапроса,
	ДатаОтвета,
	Результат,
	OIDМО,
	ДанныеПациента
)
Экспорт
	
	НаборЗаписей_ = РегистрыСведений.ФедеральныеВебСервисыЗапросыВСервисИдентификации.СоздатьНаборЗаписей();
	Запись_ = НаборЗаписей_.Добавить();
	Запись_.ИдентификаторСообщенияИзМИС = ИдентификаторСообщенияИзМИС;
	Запись_.ИдКлиента = ИдКлиента;
	Запись_.СтатусЗапроса = Статус;
	Запись_.ИдентификаторСообщенияИзСервиса = ИдентификаторЗапроса;
	Запись_.ВремяИзменения = ДатаЗапроса;
	Запись_.ДатаПолученияОтвета = ДатаОтвета;
	Запись_.СообщениеЗапрос = СообщениеЗапрос;
	Запись_.ОтветСервиса = СообщениеОтвет;
	Запись_.Комментарий = Результат;
	Запись_.OIDМО = OIDМО;
	
	Запись_.Фамилия = ДанныеПациента.Фамилия;
	Запись_.Имя = ДанныеПациента.Имя;
	Если ЗначениеЗаполнено(ДанныеПациента.Отчество) Тогда
		Запись_.Отчество = ДанныеПациента.Отчество;
	КонецЕсли;
	Запись_.ДатаРождения = ДанныеПациента.ДатаРождения;
	
	Если ЗначениеЗаполнено(ДанныеПациента.ДокументВид) Тогда
		Запись_.ДокументВид = ДанныеПациента.ДокументВид;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПациента.ДокументСерия) Тогда
		Запись_.ДокументСерия = ДанныеПациента.ДокументСерия;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПациента.ДокументНомер) Тогда
		Запись_.ДокументНомер = ДанныеПациента.ДокументНомер;
	КонецЕсли;
	
	НаборЗаписей_.Записать(Ложь);
	
КонецПроцедуры

/// Запись ответа от сервиса идентификации
//
// Параметры:
//   ИдентификаторСообщенияИзМИС - Строка -
//     Идентификатор сообщения из МИС.
//   Статус - ПеречислениеСсылка.СтатусыЗапросовВСервисИдентификацииОбогащения -
//     Статус запроса в сервис идентификации.
//   СообщениеОтвет - Строка -
//     Текст сообщения.
//   ДатаОтвета - Дата -
//     Дата ответа.
//   Результат - Строка -
//     Данные результата.
//   ИдентификаторЗапроса - Строка -
//     Идентификатор запроса из сервиса идентификации.
///
Функция ЗаписатьОтвет( // 5 параметров
	ИдентификаторСообщенияИзМИС,
	Статус,
	СообщениеОтвет,
	ДатаОтвета,
	Результат
)
Экспорт
	
	Успех_ = Истина;
	Попытка
		
		НаборЗаписей_ = РегистрыСведений.ФедеральныеВебСервисыЗапросыВСервисИдентификации.СоздатьНаборЗаписей();
		НаборЗаписей_.Отбор.ИдентификаторСообщенияИзМИС.Установить(ИдентификаторСообщенияИзМИС);
		НаборЗаписей_.Прочитать();
		Если НаборЗаписей_.Количество() = 1 Тогда
			Запись_ = НаборЗаписей_[0];
			Запись_.СтатусЗапроса = Статус;
			Запись_.ОтветСервиса = СообщениеОтвет;
			Запись_.ДатаПолученияОтвета = ДатаОтвета;
			Запись_.Комментарий = Результат;
			НаборЗаписей_.Записать(Истина)
		КонецЕсли;
		
	Исключение
		ВызватьИсключение "Не удалось записать результат обмена."
			+ Символы.ПС
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			+ Символы.ПС
		;
	КонецПопытки;
КонецФункции

/// Изменяет статус запроса
//
// Параметры:
//   ИдентификаторСообщенияИзМИС - Строка -
//     Идентификатор сообщения из МИС.
//   Статус - ПеречислениеСсылка.СтатусыЗапросовВСервисИдентификацииОбогащения -
//     Статус запроса в сервис идентификации.
///
Функция ИзменитьСтатусЗапроса(ИдентификаторСообщенияИзМИС, Статус) Экспорт
	
	Успех_ = Истина;
	Попытка
		
		НаборЗаписей_ = РегистрыСведений.ФедеральныеВебСервисыЗапросыВСервисИдентификации.СоздатьНаборЗаписей();
		НаборЗаписей_.Отбор.ИдентификаторСообщенияИзМИС.Установить(ИдентификаторСообщенияИзМИС);
		НаборЗаписей_.Прочитать();
		Если НаборЗаписей_.Количество() = 1 Тогда
			Запись_ = НаборЗаписей_[0];
			Запись_.СтатусЗапроса = Статус;
			НаборЗаписей_.Записать(Истина)
		КонецЕсли;
		
	Исключение
		ВызватьИсключение "Не удалось изменить статус запроса."
			+ Символы.ПС
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			+ Символы.ПС
		;
	КонецПопытки;
КонецФункции

/// Проверка наличия в регистре запросов, которые находятся в очереди в сервисе идентификации.
//
// Возвращаемое значение:.
//   Структура, Неопределено -
//     Данные сообщения в очереди на получение полиса ОМС.
///
Функция СледующийЗапросВОчереди() Экспорт
	
	Запрос_ = Новый Запрос;
	
	Запрос_.Текст = 
		"ВЫБРАТЬ
		|	ФедеральныеВебСервисыЗапросыВСервисИдентификации.СтатусЗапроса КАК СтатусЗапроса,
		|	ФедеральныеВебСервисыЗапросыВСервисИдентификации.ИдентификаторСообщенияИзСервиса КАК ИдентификаторСообщенияИзСервиса,
		|	ФедеральныеВебСервисыЗапросыВСервисИдентификации.ИдентификаторСообщенияИзМИС КАК ИдентификаторСообщенияИзМИС,
		|	ФедеральныеВебСервисыЗапросыВСервисИдентификации.OIDМО КАК OIDМО
		|ИЗ
		|	РегистрСведений.ФедеральныеВебСервисыЗапросыВСервисИдентификации КАК ФедеральныеВебСервисыЗапросыВСервисИдентификации
		|ГДЕ
		|	ФедеральныеВебСервисыЗапросыВСервисИдентификации.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовВСервисИдентификацииОбогащения.ВПроцессеОбработки)";
	
	РезультатЗапроса_ = Запрос_.Выполнить();
	
	ВыборкаДетальныеЗаписи_ = РезультатЗапроса_.Выбрать();
	Если ВыборкаДетальныеЗаписи_.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи_;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСообщениеСОтветомСервисаИдентификации(ИдентификаторСообщенияИзСервиса) Экспорт
	
	Запрос_ = Новый Запрос;
	Запрос_.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФедеральныеВебСервисыЗапросыВСервисИдентификации.ОтветСервиса КАК ОтветСервиса,
		|	ФедеральныеВебСервисыЗапросыВСервисИдентификации.СтатусЗапроса КАК СтатусЗапроса,
		|	ФедеральныеВебСервисыЗапросыВСервисИдентификации.ИдентификаторСообщенияИзМИС КАК ИдентификаторСообщенияИзМИС
		|ИЗ
		|	РегистрСведений.ФедеральныеВебСервисыЗапросыВСервисИдентификации КАК ФедеральныеВебСервисыЗапросыВСервисИдентификации
		|ГДЕ
		|	ФедеральныеВебСервисыЗапросыВСервисИдентификации.ИдентификаторСообщенияИзСервиса = &ИдентификаторСообщенияИзСервиса";
	
	Запрос_.УстановитьПараметр("ИдентификаторСообщенияИзСервиса", ИдентификаторСообщенияИзСервиса);
	
	РезультатЗапроса_ = Запрос_.Выполнить();
	
	Выборка_ = РезультатЗапроса_.Выбрать();
	
	СообщениеОтвет_ = Неопределено;
	
	Если Выборка_.Следующий() Тогда
		СообщениеОтвет_ = Выборка_;
	КонецЕсли;
	
	Возврат СообщениеОтвет_;
	
КонецФункции

Функция ПолучитьСообщениеСОтветомПоДаннымПациента(ДанныеПациента) Экспорт
	
	Запрос_ = Новый Запрос;
	Запрос_.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФедеральныеВебСервисыЗапросыВСервисИдентификации.ОтветСервиса КАК ОтветСервиса,
		|	ФедеральныеВебСервисыЗапросыВСервисИдентификации.СтатусЗапроса КАК СтатусЗапроса,
		|	ФедеральныеВебСервисыЗапросыВСервисИдентификации.ИдентификаторСообщенияИзМИС КАК ИдентификаторСообщенияИзМИС
		|ИЗ
		|	РегистрСведений.ФедеральныеВебСервисыЗапросыВСервисИдентификации КАК ФедеральныеВебСервисыЗапросыВСервисИдентификации
		|ГДЕ
		|	ФедеральныеВебСервисыЗапросыВСервисИдентификации.Фамилия = &Фамилия
		|	И ФедеральныеВебСервисыЗапросыВСервисИдентификации.Имя = &Имя
		|	И ФедеральныеВебСервисыЗапросыВСервисИдентификации.Отчество = &Отчество
		|	И ФедеральныеВебСервисыЗапросыВСервисИдентификации.ДокументВид = &ДокументВид
		|	И ФедеральныеВебСервисыЗапросыВСервисИдентификации.ДокументНомер = &ДокументНомер
		|	И ФедеральныеВебСервисыЗапросыВСервисИдентификации.ДокументСерия = &ДокументСерия";
	
	Запрос_.УстановитьПараметр("Фамилия", ДанныеПациента.Фамилия);
	Запрос_.УстановитьПараметр("Имя", ДанныеПациента.Имя);
	
	Отчество_ = "";
	Если ЗначениеЗаполнено(ДанныеПациента.Отчество) Тогда
		Отчество_ = ДанныеПациента.Отчество;
	КонецЕсли;
	Запрос_.УстановитьПараметр("Отчество", Отчество_);
	
	Запрос_.УстановитьПараметр("ДокументВид", ДанныеПациента.ДокументВид);
	
	Серия_ = "";
	Если ЗначениеЗаполнено(ДанныеПациента.ДокументСерия) Тогда
		Серия_ = ДанныеПациента.ДокументСерия;
	КонецЕсли;
	Запрос_.УстановитьПараметр("ДокументСерия", Серия_);
	
	Запрос_.УстановитьПараметр("ДокументНомер", ДанныеПациента.ДокументНомер);
	
	РезультатЗапроса_ = Запрос_.Выполнить();
	Выборка_ = РезультатЗапроса_.Выбрать();
	
	СообщениеОтвет_ = Неопределено;
	
	Если Выборка_.Следующий() Тогда
		СообщениеОтвет_ = Выборка_;
	КонецЕсли;
	
	Возврат СообщениеОтвет_;
	
КонецФункции

#КонецОбласти
